start_text = "Привет!\nХочешь получить образование в аграрной сфере и построить в ней карьеру, но не знаешь, какую профессию выбрать? Наш бот поможет тебе в этом. Просто пройди тест и получишь рекомендацию в выборе специальности, с примерами ВУЗов в которые ты можешь поступить. Также тебе будут доступны источники с полезной информацией об отрасли. Ну что, приступим?"
info_text = "Этот бот, рекомендует вам одну из 12 специальностей в сельском хозяйстве, предложив несколько ВУЗов с рекомендованной специальностью, полезную информацию для самостоятельного изучения, а также даст вам советы, как найти практику и стажировку. Цель этого бота — помочь выбрать будущую специализацию школьникам, дав им 'пищу для размышления'"

help_text = 'Что бы начать работу с ботом напишите /start \nЕсли у вас возникли какие-то проблемы пишите @Juliya1899'
other_text = 'Что бы начать работу с ботом напишите /start \nЕсли у вас возникли какие-то проблемы напишите /help'

text_ra = "Часто перед студентами возникает сложность в поиске практики или стажировки по специальности. Если вы хотите изучить этот вопрос то вам стоит попробовать пойти по следующему алгоритму действий:Связаться с соответствующим отделом в интересующем вас ВУЗе или изучить информацию о практике на его сайте (например https://vk.cc/cfNecv у  Российской государственной аграрной университета имени К.А. Тимирязева)" \
          "Искать предложения о стажировках и практике в сервисах-агрегаторах вакансий (например сервис “Я в агро” – https://vk.cc/cfNdW5 и DIRECT.FARM –  https://vk.cc/cfNesg, Agrowork.ru – https://vk.cc/cfNf7T  или не специализированные агрегаторы вроде https://vk.cc/cfNeAj)" \
          "Изучать сайты конкретных агрокомпаний, на предмет доступной практики/стажировки. В крупных фирмах зачастую есть специальные подразделения отвечающие за этоот список некоторых крупных агрокомпаний, имеющих информацию о стажировке и практике на своих сайтах:" \
          "\nПромидекс – https://vk.cc/cfNcUd" \
          "\nМираторг – https://vk.cc/c8JEd3" \
          "\nАгроэко – https://vk.cc/cfNcXm" \
          "\nРусское поле – https://vk.cc/cfNeWi" \
          "\nСОЮЗСНАБ – https: //vk.cc/cfNeXT" \
          "\nЧеркизово – https: //vk.cc/cfNf0b" \
          "\nРУСАГРО – https: //vk.cc/cfNf2h"

question_text_1 = "Вопрос №1 из 10\nДля работы ты рассматриваешь исключительно сельскохозяйственную отрасль или это лишь один из нескольких вариантов? "
question_text_2 = "Вопрос №2 из 10\nХотел бы ты руководить командой или делать исключительно свою часть работы не отвечая за других?  "
question_text_3 = "Вопрос №3 из 10\nЧем обусловлен твой выбор?  Интересами,престижностью профессии и заработком,другое (вписать)"
question_text_4 = "Вопрос №4 из 10\nОцени свои знания в биологии от 1 до 10"
question_text_5 = "Вопрос №5 из 10\nОцени свои знания в химии от 1 до 10"
question_text_6 = "Вопрос №6 из 10\nОцени свои знания в физике от 1 до 10"
question_text_7 = "Вопрос №7 из 10\nОцени свои знания в информатике от 1 до 10"
question_text_8 = "Вопрос №8 из 10\nЧто тебя больше всего интересует из предложенного?"
question_text_9 = "Вопрос №9 из 10\nТы предполагаешь, что будешь заниматься наукой/введением инноваций или собственно производственным процессом?"
question_text_10 = "Вопрос №10 из 10\nПринимал ли участие в олимпиадах/проектах в школе?"
answer_1_0 = "Управление в сельском хозяйстве\n" \
             "Менеджер в сельском хозяйстве - управленец организующий и контролирующий деятельность фермерских хозяйств и прочих аграрных предприятий." \
             "\nПримеры ВУЗов с данной специальностью:" \
             "\n1) Российский государственный аграрный университет - МСХА имени К.А. Тимирязева – https://vk.cc/cfMbos " \
             "\n2) Красноярский государственный аграрный университет – https://vk.cc/cfMbi8 " \
             "\n3) Санкт-Петербургский государственный аграрный университет – https://vk.cc/cfMbq8 "
answer_1_1 = "Полезная информация для изучения специальности:" \
             "\n1) О системах управления агробизнесом - https://vk.cc/cfMbqW " \
             "\n2) Агроменеджмент в современном мире - https://vk.cc/cfMbrZ" \
             "\n3) Как совершенствовать управление в сельском хозяйстве - https://vk.cc/cfMbsP "
answer_2_0 = "Технологии производства и переработки сельскохозяйственной продукции\n" \
             "Данная специализация заключается организации и обеспечении деятельности преприятия по производству любого вида сельскохозяйственной продукции, перерабатывающее или пищевое, а также предприятие с законченным циклом производства и торговой сетью. В рамках этой задачи технологи занимаются закупкой подсобных материалов и сырья, следят за производственными процессами и соблюдением установленных технологий, проводят переговоры с поставщиками товаров и услуг, контролируют персонал и тд. Современный термин фудтех, обозначающий инновации и технологии в производстве пищи напрямую относится к этой профеессии." \
             "\nПримеры ВУЗов с данной специальностью:" \
             "\n1) Российский государственный аграрный университет - МСХА имени К.А. Тимирязева – https://vk.cc/cfMcAc " \
             "\n2) Кубанский государственный аграрный университет – https://vk.cc/cfMcDm" \
             "\n3) Арктический государственный агротехнологический университет – https://vk.cc/cfMcGD"
answer_2_1 = "Полезная информация для изучения специальности:" \
             "\n1) О фудтехе – https://vk.cc/cfMcb4 " \
             "\n2) О будущих инновациях в отрасли – https://vk.cc/cfMccc" \
             "\n3) О развитии пищевой промышленности в будущем – https://vk.cc/cfMcdO " \
             "\n4) О технологиях производства и переработки сельскохозяйственной продукции –  https://vk.cc/cfMceB "

answer_3_0 = "Селекционер — это человек, который занимается выведением новых сортов растений и пород животных, а также улучшением уже имеющихся характеристик. Это делается для того, чтобы повысить полезность животных и растений для человека (например сделать пшеницу более морозостойкой, а коров более быстрорастущими)" \
             "\nПример ВУЗов с этой специализацие" \
             "\n1) Российский государственный аграрный университет — МСХА им. К.А. Тимирязева – https://vk.cc/cfMayB" \
             "\n2) ФГБОУ ВО МГАВМиБ - МВА имени К.И. Скрябина – https://vk.cc/cfMalQ " \
             "\n3) Кемеровский государственный сельскохозяйственный институт – https://vk.cc/cfMaED"
answer_3_1 = "Полезная информация для изучения данной специальности:" \
             "\n1) Статья состоянии отрасли (конкрено селекции растений) в России на данный момент и о ее перспективах -  https://vk.cc/cfMaFM " \
             "\n2) Статья о состоянии селекции (растений) в России и проекте ВШЭ по ее развитию https://vk.cc/cfMaIg" \
             "\n3)Подробно о селекции в животноводстве: ее история, методы, современное состояние https://vk.cc/cfMaMw" \
             "\n4) Возможности дополнительного образования для селекционеров - https://vk.cc/cfMaNu"

answer_4_0 = "Зоотехник - специалист в разведении сельскохозяйственных животных, формирующий кормовую базу, создающий оптимальные условия для их содержания, лечения, разведения. Он также контролирует качество и этапы производства продуктов из животного сырья. То есть, это профессионал широкого профиля, имеющий разнообразные компетенции (в том числе и в селекции). " \
             "\nПримеры ВУЗов с данной специализацией:" \
             "\n1) Санкт-Петербургский государственный аграрный университет – https://vk.cc/cfMaXs " \
             "\n2) Московский государственный университет леса (Мытищинский филиал МГТУ им. Н. Э. Баумана) – https://vk.cc/cfMb2t" \
             "\n3) Российский государственный аграрный университет - МСХА имени К.А. Тимирязева – https://vk.cc/cfMb51"
answer_4_1 = "Полезная информация для изучения специальности:" \
             "\n1) О современном животноводстве - https://vk.cc/cfMaPU" \
             "\n2) О современных инновациях в животноводстве - https://vk.cc/cfMaOQ" \
             "\n3) Еще информации о данной специализации - https://vk.cc/cfMaR1"

answer_5_0 = "Природопользование и экология\nОбучившись этой специальности, студент получит знания обустройстве природы, экологии и рациональном взаимодействии человека и природы. В последствии студент сможет работать по этим специальностям: агроэколог, биоэколог, геоэколог, гидроэколог, эколог, эколог-аудитор, эколог-инспектор, эколог-природопользователь. Агроэколог занимается исследованием и защитой рационального использования земельных ресурсов, воды, воздуха, осуществляет комплекс мер по охране их от загрязнений. Также в его обязанности входит изучение, защита растений и животных в сельском хозяйстве от различных вирусов, грибков и болезней.\nБиоэкологи осуществляют свою деятельность в основном в лабораториях и исследовательских центрах. Их задача - изучение составляющих экосистемы и разработка мер по сохранению их баланса.\nГеоэкологи сопровождают все строительные работы. Любая стройка должны иметь заключение данного специалиста. Во-первых, он должен определить, насколько ущербным для природы будет возведение нового объекта, во-вторых, как окружающая среда отреагирует, какие катаклизмы и аварии могут происходить.\nПрофессия гидроэколога связана с водохранилищами, реками, озерами, грунтовыми водами, их биологической составляющей и степенью безопасности в плане загрязнений. Разработка очистных сооружений, нормативная документация по использованию водных ресурсов, отчеты по проделанным работам - вот что предстоит делать этому специалисту.\nЭколог и эколог-инженер требуются на всех заводах и фабриках, а также в организациях, занимающихся добывающей промышленностью. Все действия участников рынка должны укладываться в нормы экологических предписаний, не превышать допустимые уровни по загрязнению и безопасности. Следить за всем этим и должен эколог.\nАудиторы и инспекторы в области экологии работают в проверяющих органах, различных санитарно-эпидемиологических станциях, государственных службах по контролю, органах статистики. Их обязанность - проверка исполнения предписаний, наложение санкций на субъекты, нарушающие нормативы." \
             "\nПример ВУЗов для данной специальности:" \
             "\n1)Ландшафтная экология и заповедное дело, КФУ им. Вернадского – https://vk.cc/cfM8Qm" \
             "\n2) Экологический менеджмент и аудит, КФУ им. Вернадского – https://vk.cc/cfM8UA" \
             "\n3) Управление экологической безопасностью МАИ – https://vk.cc/cfM8Yf" \
             "\n4) Судебная экология РУДН – https://vk.cc/cfM92m"
answer_5_1 = "Полезная информация для изучения специальности:" \
             "\n1) О том как стать экологом – https://vk.cc/cfM93C " \
             "\n2) Список профессий связанный с экологией - https://vk.cc/cfM94m " \
             "\n3) Об экологии и природопользовании в целом - https://vk.cc/cfM95h"

answer_6_0 = "Водопользование и гидро мелещзфция\nСтуденты, на этой специализации изучают водное хозяйство и гидротехнические сооружения, процесс эксплуатации водохозяйственных объектов, экономику, менеджмент, маркетинг и сметное дело в сфере водного хозяйства, управление гидромелиоративным строительством, а также экологию, охрану окружающей среды и гидрологию." \
             "\nПример ВУЗов для данной специальности:" \
             "\n1) Новочеркасский инженерно-мелиоративный институт имени А.К. Кортунова - филиал Донского государственного аграрного университета – https://vk.cc/cfMbYr" \
             "\n2) Российский государственный аграрный университет - МСХА имени К.А. Тимирязева – https://vk.cc/cfMc3V " \
             "\n3) Алтайский государственный аграрный университет – https://vk.cc/cfMc74"
answer_6_1 = "Полезные материалы для изучения специальности:" \
             "\n1) О мелеорации – https://vk.cc/cfMbTz" \
             "\n2) О защите водных экосистем России – https://vk.cc/cfMbUE " \
             "\n3) О водной мелиорации и ее значении – https://vk.cc/cfMbVV" \
             "\n4) О проблеме напрямую касающейся сферы профессиональных интересов данной специализации – https://vk.cc/cfMbWP"

answer_7_0 = "Ветеринар\nЗадача человека данной профессии - оказание медицинской помощи животным. Проще говоря - врач для братьев наших меньших." \
             "\nПример ВУЗов для данной специальности:" \
             "\n1) Санкт-Петербургская академия ветеринарной медицины – https://vk.cc/cfM9bf" \
             "\n2) ФГБОУ ВО МГАВМиБ - МВА имени К.И. Скрябина – https://vk.cc/cfMalQ" \
             "\n3) Донской технический университет – https://vk.cc/cfMajh "
answer_7_1 = "Полезные материалы для изучения специальности:" \
             "\n1) Профессиональный ветеринарный журнал - https://vk.cc/cfMao6" \
             "\n2) Подробнее о специальности - https://vk.cc/cfMapk" \
             "\n3) Подробнее об обучении на ветеринара - https://vk.cc/7ZaQGH"

answer_8_0 = "Биология/Биотехнологии\nБиологи и биотехнологи работают с живыми биологическими организмами, их системами и процессами с целью создания новых сортов продуктов, растений, витаминов, а также улучшения свойств существующих видов в растительной и животной среде, устойчивых к неблагоприятным климатическим условиям, вредителям и болезням." \
             "\nПример ВУЗов для данной специальности:" \
             "\n1) МГУ имени Ломоносова – https://vk.cc/2sFKhT" \
             "\n2) Российский государственный аграрный университет - МСХА имени К.А. Тимирязева – https://vk.cc/cfMbCZ" \
             "\n3) НИУ ВШЭ – https://vk.cc/cfMbEp"
answer_8_1 = "Полезные материалы для изучения специальности:" \
             "\n1) О синтетической биологии в сельском хозяйстве - https://vk.cc/cfMbFq" \
             "\n2) О применении биологии в сельском хозяйстве - https://vk.cc/cfMbHz" \
             "\n3) О биотехнологии и генной инженерии - https://vk.cc/cfMbIU " \
             "\n4) О биотехе - https://vk.cc/8KNXp8"

answer_9_0 = "Агрохимик - человек освоивший эту программу будет иметь широкий спектр знаний в области химии на благо сельского хозяйства (например создание нового удорение или подбор их комбинации для определенных условий, но сфера интересов агрохимика гораздо шире удобрений)." \
             "\nПочвоведение - специализация, предполагающая изучение почвы, анализа ее состава и составление рекомендаций по ее рациональному использованию. Сфера деятельности предполагает знания научных отраслей естественного (химия, физика, математика, проч.) и биологического (микробиология, ботаника, климатология, биогеохимия, геоморфология и т. д.) циклов. " \
             "\nПример ВУЗов для данной специальности(Агрохимия):" \
             "\n1) Российский государственный аграрный университет МСХА имени К. А. Тимирязева – https://vk.cc/cfM6Z8" \
             "\n2) Казанский государственный аграрный университет – https://vk.cc/cfM73f" \
             "\n3) Волгоградский государственный аграрный университет – https://vk.cc/cfM75j" \
             "\nПример ВУЗов для данной специальности(Почвоведенье):" \
             "\n1) МГУ имени Ломоносова – https://vk.cc/cfM774" \
             "\n2) Российский государственный аграрный университет имени К. А. Тимирязева – https://vk.cc/cfM79T" \
             "\n3) Томский государственный университет – https://vk.cc/cfM7dM"
answer_9_1 = "Полезные материалы для изучения специальности:(Агрохимия)" \
             "\n1) Об иновациях в отрасли – https://vk.cc/cfM6SS" \
             "\n2) Статья, помимо всего прочего, показывающая значимость агрохимии для сельского хозяйства – https://vk.cc/cfM6Ua" \
             "\n3)  Про агрохимию и агрохимиках в общих чертах – https://vk.cc/cfM6Vd" \
             "\nПолезные материалы для изучения специальности:(Почьвоведение)" \
             "\n1) О почвоведении как о науке – https://vk.cc/cfM7nF" \
             "\n2)О современном состоянии сферы -  https://vk.cc/cfM86R" \
             "\n3) Общая информация про Почвоведение как направление обучения - https://vk.cc/cfM7m3 "

answer_10_0 = "Агрономия\nАгроном - это специалист в области сельскохозяйственного производства растений и грибов." \
              "\nПример ВУЗов для данной специальности:" \
              "\n1) Российский университет дружбы народов – https://vk.cc/cfMdi9 " \
              "\n2) Российский государственный аграрный университет - МСХА имени К.А. Тимирязева – https://vk.cc/cfMdk0" \
              "\n3) Московский государственный университет технологий и управления им. К.Г. Разумовского (ПКУ) – https://vk.cc/cfMdmA"
answer_10_1 = "Полезные материалы для изучения специальности:" \
              "\n1) О том как работают современные агрономы – https://vk.cc/cfMdeK " \
              "\n2) Аналитика современного состояния профессии – https://vk.cc/cfMddj" \
              "\n3) Профессиональный журнал – https://vk.cc/cfMdaP"

answer_11_0 = "Агроинформатик - высококвалифицированный специалист, отвечающий за разработку и внедрение инновационных технологий, направленных на автоматизацию и информатизацию аграрного предприятия.В отличие от многих других сельскохозяйственных специальностей, для этой специализации не критичен именно аграрный уклон, поэтому имеет смысл рассматривать в том числе смежные направления обучения." \
              "\nПример ВУЗов для данной специальности:" \
              "\n1) Российский государственный аграрный университет — МСХА им. К.А. Тимирязева – https://vk.cc/cfM8nX" \
              "\n2) Кубанский государственный аграрный университет – https://vk.cc/cfM8ta" \
              "\n3) Казанский государственный аграрный университет – https://vk.cc/cfM8wX"
answer_11_1 = "Полезные материалы для изучения специальности:" \
              "\n1) О том что такое агроинформатика - https://vk.cc/cfM8AR" \
              "\n2) Поможет понять насколько тебе подходит данная профессия и понять ее основы - https://vk.cc/cfM8BI " \
              "\n3) Об освоении специальности - https://vk.cc/cfM8Cg"

answer_12_0 = "Агроиженерия\n" \
              "Агроинженер - профессионал, который может создавать новую аппаратуру, современные устройства и технологии, и внедрять их в производственный процесс. Кадры, подготовленные по данной специальности, могут трудиться как в научной сфере, так и на производстве либо в области управления." \
              "\nПример ВУЗов для данной специальности:" \
              "\n1) Российский государственный аграрный заочный университет (РГАЗУ) – https://vk.cc/cfMd1L" \
              "\n2) Российский государственный аграрный университет - МСХА имени К.А. Тимирязева (РГАУ) – https://vk.cc/cfMd4Y " \
              "\n3) Ставропольский государственный аграрный университет – https://vk.cc/cfMd7a "

answer_12_1 = "Полезные материалы для изучения специальности:" \
              "\n1) Интервью с руководителем РГАУ имени Тимирязева касательно специализациии агроинженера и ее перспектив – https://vk.cc/cfMcPy" \
              "\n2) В общем о профессии – https://vk.cc/cfMcRg" \
              "\n3) Что такое агроинженерия?– https://vk.cc/cfMcTw"

answer = {"1_0": answer_1_0,
          "1_1": answer_1_1,
          "2_0": answer_2_0,
          "2_1": answer_2_1,
          "3_0": answer_3_0,
          "3_1": answer_3_1,
          "4_0": answer_4_0,
          "4_1": answer_4_1,
          "5_0": answer_5_0,
          "5_1": answer_5_1,
          "6_0": answer_6_0,
          "6_1": answer_6_1,
          "7_0": answer_7_0,
          "7_1": answer_7_1,
          "8_0": answer_8_0,
          "8_1": answer_8_1,
          "9_0": answer_9_0,
          "9_1": answer_9_1,
          "10_0": answer_10_0,
          "10_1": answer_10_1,
          "11_0": answer_11_0,
          "11_1": answer_11_1,
          "12_0": answer_12_0,
          "12_1": answer_12_1,
          }
